In [1]:
# importing libraries
import numpy as np
import pandas as pd

In [4]:
data = pd.read_csv('chipotle.tsv',sep='\t')

In [5]:
data

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [6]:
data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [7]:
data.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [8]:
data.shape

(4622, 5)

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [10]:
data.isnull().sum()

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

In [13]:
data.drop('choice_description', axis=1, inplace=True)

In [14]:
data

      order_id  quantity                              item_name item_price
0            1         1           Chips and Fresh Tomato Salsa     $2.39
1            1         1                                   Izze     $3.39
2            1         1                       Nantucket Nectar     $3.39
3            1         1  Chips and Tomatillo-Green Chili Salsa     $2.39
4            2         2                           Chicken Bowl    $16.98
...        ...       ...                                    ...        ...
4617      1833         1                          Steak Burrito    $11.75
4618      1833         1                          Steak Burrito    $11.75
4619      1834         1                     Chicken Salad Bowl    $11.25
4620      1834         1                     Chicken Salad Bowl     $8.75
4621      1834         1                     Chicken Salad Bowl     $8.75

[4622 rows x 4 columns]

In [15]:
df = pd.DataFrame(data)

In [16]:
df['item_price'] = pd.to_numeric(df['item_price'].str.replace('[\$,]', '', regex=True), errors='coerce')

In [18]:
df

      order_id  quantity                              item_name  item_price
0            1         1           Chips and Fresh Tomato Salsa        2.39
1            1         1                                   Izze        3.39
2            1         1                       Nantucket Nectar        3.39
3            1         1  Chips and Tomatillo-Green Chili Salsa        2.39
4            2         2                           Chicken Bowl       16.98
...        ...       ...                                    ...         ...
4617      1833         1                          Steak Burrito       11.75
4618      1833         1                          Steak Burrito       11.75
4619      1834         1                     Chicken Salad Bowl       11.25
4620      1834         1                     Chicken Salad Bowl        8.75
4621      1834         1                     Chicken Salad Bowl        8.75

[4622 rows x 4 columns]

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    4622 non-null   int64
 1   quantity    4622 non-null   int64
 2   item_name   4622 non-null   object
 3   item_price  4622 non-null   float64
dtypes: float64(1), int64(2), object(1)
memory usage: 144.6+ KB

In [22]:
#Quantity of each item? (Top 5 itmes available in store)
top_5_rows = df.nlargest(5, 'quantity')
print(top_5_rows)

      order_id  quantity                     item_name  item_price
3598      1443        15  Chips and Fresh Tomato Salsa       44.25
4152      1660        10                 Bottled Water       15.00
3887      1559         8                 Side of Chips       13.52
3599      1443         7                 Bottled Water       10.50
2441       970         5                 Bottled Water        7.50

In [24]:
#which is most ordered item in choice_description?
top_5_rows = df.nlargest(1, 'order_id')
print(top_5_rows)

      order_id  quantity           item_name  item_price
4619      1834         1  Chicken Salad Bowl       11.25

In [25]:
#What is total order count?
column_sum = df['quantity'].sum()
print(column_sum)

4972

In [27]:
#What is reveneu?
df['rev'] = df['quantity'] * df['item_price']
total_product = df['rev'].sum()
total_product

39237.02

In [30]:
#Whta is average revenue amount per order?
ave = total_product / column_sum
ave

7.8915969428801285